/*
 * This file is part of the CitizenFX project - http://citizen.re/
 *
 * See LICENSE and MENTIONS in the root of the source tree for information
 * regarding licensing.
 */

#include <StdInc.h>
#include <jitasm.h>
#include <Hooking.h>
#include <Hooking.Stubs.h>

#include <Pool.h>

#include <algorithm>
#include <array>

#include <gameSkeleton.h>

#include <boost/algorithm/string.hpp>

#include <Error.h>

#include <CoreConsole.h>

#include <IteratorView.h>
#include <ICoreGameInit.h>
#include <GameInit.h>

#include <MinHook.h>

#include <CrossBuildRuntime.h>

#include <CustomRtti.h>

#if __has_include(<StatusText.h>)
#include <StatusText.h>
#include <nutsnbolts.h>
#endif

#ifdef GTA_FIVE
static void(*dataFileMgr__loadDat)(void*, const char*, bool);
static void(*dataFileMgr__loadDefDat)(void*, const char*, bool);
#elif IS_RDR3
static void(*dataFileMgr__loadDat)(void*, const char*, bool, void*);
static void(*dataFileMgr__loadDefDat)(void*, const char*, bool, void*);
#endif

static bool IsEvaluationServer()
{
	std::string policyVal;

	if (Instance<ICoreGameInit>::Get()->GetData("policy", &policyVal))
	{
#ifndef _DEBUG
		if (policyVal.find("[local_evaluation]") != std::string::npos)
#endif
		{
			return true;
		}
	}

	return false;
}

// blocked assets part of 2545
static const std::set<std::string> g_blockedNames2372 =
{
	"astron.yft",
	"astron.ytd",
	"astron_hi.yft",
	"champion.yft",
	"champion.ytd",

	"tr_int2_sliding_door_004.ydr",
	"tr_int2_sliding_door_01.ydr",
	"tr_int2_sliding_door_02.ydr",
	"tr_int2_start_spot.ydr",
	"tr_int2_tats_n_sht.ydr",
	"tr_int2_track_lines.ydr",
	"tr_int2_tuner_car_meet_txd.ytd",
	"tr_int2_turn_marks.ydr",
	"tr_int2_view_rm1_decals.ydr",
	"tr_int2_view_rm1_details.ydr",
	"tr_int2_view_rm2_decals.ydr",
	"tr_int2_wee_stanes.ydr",
	"tr_tuner_car_meet.ybn",
	"tr_dlc_int_04_tr.ytyp",
	"tr_int4_blends.ydr",
	"tr_int4_conduit.ydr",
	"tr_int4_details.ydr",
	"tr_int4_door.ydr",
	"tr_int4_hiddenshell.ydr",
	"tr_int4_methkit_basic.ydr",
	"tr_int4_methkit_bas_decals.ydr",
	"tr_int4_methkit_lightproxy.ydr",
	"tr_int4_methkit_set_decals.ydr",
	"tr_int4_methkit_set_details.ydr",
	"tr_int4_misc_details.ydr",
	"tr_int4_racks.ydr",
	"tr_int4_shell.ydr",
	"tr_int4_sidewindd.ydr",
	"tr_int4_structure_cs.ydr",
	"tr_int4_structure_ns.ydr",
	"tr_int4_tuner_methlab_1_txd.ytd",
	"tr_tuner_methlab_1.ybn",
	"calico+hi.ytd",
	"calico.yft",
	"calico.ytd",
	"calico_hi.yft",
	"comet6+hi.ytd",
	"comet6.yft",
	"comet6.ytd",
	"comet6_hi.yft",
	"cypher+hi.ytd",
	"cypher.yft",
	"cypher.ytd",
	"cypher_hi.yft",
	"dominator7+hi.ytd",
	"dominator7.yft",
	"dominator7.ytd",
	"dominator7_hi.yft",
	"dominator8.yft",
	"dominator8.ytd",
	"dominator8_hi.yft",
	"euros.yft",
	"euros.ytd",
	"euros_hi.yft",
	"freightcar2.yft",
	"freightcar2.ytd",
	"freightcar2_hi.yft",
	"futo2+hi.ytd",
	"futo2.yft",
	"futo2.ytd",
	"futo2_hi.yft",
	"growler+hi.ytd",
	"growler.yft",
	"growler.ytd",
	"growler_hi.yft",
	"jester4+hi.ytd",
	"jester4.yft",
	"jester4.ytd",
	"jester4_hi.yft",
	"previon.yft",
	"previon.ytd",
	"previon_hi.yft",
	"remus+hi.ytd",
	"remus.yft",
	"remus.ytd",
	"remus_hi.yft",
	"rt3000+hi.ytd",
	"rt3000.yft",
	"rt3000.ytd",
	"rt3000_hi.yft",
	"sultan3+hi.ytd",
	"sultan3.yft",
	"sultan3.ytd",
	"sultan3_hi.yft",
	"tailgater2+hi.ytd",
	"tailgater2.yft",
	"tailgater2.ytd",
	"tailgater2_hi.yft",
	"va_rt3000.ycd",
	"vectre.yft",
	"vectre.ytd",
	"vectre_hi.yft",
	"vehicles_coquette_w1_interior.ytd",
	"vehicles_coquette_w2_interior.ytd",
	"vehicles_fmj_w_interior.ytd",
	"vehicles_fmj_w_race_interior.ytd",
	"vehicles_futo_race_interior.ytd",
	"vehicles_jugular_race_interior.ytd",
	"vehicles_jugular_w_interior.ytd",
	"vehicles_monroe_race_interior.ytd",
	"vehicles_muscle_o_race_interior.ytd",
	"vehicles_pfister_interior.ytd",
	"vehicles_pfister_race_interior.ytd",
	"vehicles_supergt_w1_interior.ytd",
	"vehicles_supergt_w2_interior.ytd",
	"warrener2.yft",
	"warrener2.ytd",
	"warrener2_hi.yft",
	"zr350.yft",
	"zr350.ytd",
	"zr350_hi.yft",
};

static std::vector<std::string> g_beforeLevelMetas;
static std::vector<std::string> g_afterLevelMetas;

static std::vector<std::string> g_defaultMetas;

static std::vector<std::string> g_gtxdFiles;
static std::vector<std::pair<std::string, std::string>> g_dataFiles;
static std::vector<std::pair<std::string, std::string>> g_loadedDataFiles;

class CDataFileMgr
{
public:
	struct DataFile
	{
		char name[128];
		char pad[16]; // 128
		int32_t type; // 140
		int32_t index; // 148
		bool locked; // 152
		bool flag2; // 153
		bool flag3; // 154
		bool disabled; // 155
		bool persistent; // 156
		bool overlay;
		char pad2[10];
	};
};

namespace DataFileType
{
static int DLC_ITYP_REQUEST;
static int DLC_POP_GROUPS;
static int DLC_WEAPON_PICKUPS;
}

static void* g_dataFileMgr;

#ifdef GTA_FIVE
static void LoadDats(void* dataFileMgr, const char* name, bool enabled)
{
	// load before-level metas
	for (const auto& meta : g_beforeLevelMetas)
	{
		dataFileMgr__loadDat(dataFileMgr, meta.c_str(), enabled);
	}

	// load the level
	dataFileMgr__loadDat(dataFileMgr, name, enabled);

	// load after-level metas
	for (const auto& meta : g_afterLevelMetas)
	{
		dataFileMgr__loadDat(dataFileMgr, meta.c_str(), enabled);
	}
}

static void LoadDefDats(void* dataFileMgr, const char* name, bool enabled)
{
	g_dataFileMgr = dataFileMgr;

	// load before-level metas
	trace("Loading content XML: %s\n", name);

	// load the level
	dataFileMgr__loadDefDat(dataFileMgr, name, enabled);
}

#elif IS_RDR3
